{
    "data": {
        "first_name": "Kadek Restu",
        "last_name": "Satya Wardana",
        "email": "kadekrestusatyawardana@gmail.com",
        "phone_number": "6281337982927",
        "address": "Jl. Nagasari No.28, Penatih Dangin Puri, Kec. Denpasar Tim., Kota Denpasar, Bali 80237",
        "about": "I am an experienced Full Stack Developer with over 8 years in building reliable, scalable web and mobile applications that align with business needs. Skilled in Vue.js and React.js for the frontend, and PHP Laravel and Golang for the backend, I bring together diverse technologies to create seamless user experiences. For mobile development, I use Flutter to deliver responsive, cross-platform applications.",
        "profile_image": "https://avatars.githubusercontent.com/u/184176888?v=4&size=512",
        "social_medias": [{
                "name": "facebook",
                "link": "#",
                "icon": "fab fa-facebook-f"
            },
            {
                "name": "instagram",
                "link": "https://www.instagram.com/kdrestusat_",
                "icon": "fab fa-instagram"
            },
            {
                "name": "linkend",
                "link": "https://www.linkedin.com/in/kadek-satya-wardana-3467b4297",
                "icon": "fab fa-linkedin-in"
            }
        ],
        "experiences": [{
            "name": "Freelance Web Developer",
            "position": "Full Stack Developer",
            "duration": "March 2016 - Current",
            "items": [{
                    "name": "2016 - Memulai karir sebagai Full-Stack Developer",
                    "description": "Awal fokus pada pengembangan program koperasi, membantu berbagai koperasi dalam memodernisasi sistem manajemen mereka. Proyek ini berfokus pada pencatatan keuangan, pengelolaan anggota, dan transaksi."
                },
                {
                    "name": "2017 - 2018 - Pengembangan E-commerce dan POS",
                    "description": "Mulai menangani proyek e-commerce, baik untuk platform web maupun mobile, serta sistem POS (Point of Sale) untuk bisnis retail. Proyek ini melibatkan integrasi pembayaran, pengelolaan inventaris, dan fitur-fitur untuk meningkatkan pengalaman pengguna di platform e-commerce."
                },
                {
                    "name": "2019 - Banking dan Sistem Profil Perusahaan",
                    "description": "Bekerja dalam proyek untuk institusi keuangan yang melibatkan sistem perbankan serta pengembangan website company profile menggunakan WordPress dan Laravel. Mengembangkan situs yang menarik secara visual dan informatif untuk perusahaan dalam berbagai sektor."
                },
                {
                    "name": "2020 - Proyek Pemerintah (Smart Desa dan GIS)",
                    "description": "Terlibat dalam proyek pemerintah, seperti Smart Desa yang bertujuan untuk mendigitalkan layanan masyarakat desa dan sistem GIS (Geographic Information System) untuk pemetaan dan analisis wilayah."
                },
                {
                    "name": "2021 - 2023 - Sistem Absensi Sekolah dan Pengembangan Proyek Lainnya",
                    "description": "Membangun sistem absensi untuk sekolah, yang memungkinkan institusi pendidikan memonitor kehadiran siswa dengan lebih efisien. Selama periode ini, juga menangani berbagai proyek tambahan sesuai kebutuhan klien di sektor pemerintahan, pendidikan, dan bisnis."
                },
                {
                    "name": "2024 - Sekarang - Pengembangan Berkelanjutan",
                    "description": "Mengembangkan berbagai aplikasi dengan teknologi terbaru, seperti Vue.js, React.js, PHP Laravel, Golang, dan Flutter. Melanjutkan peran sebagai full-stack developer dengan fokus pada penyempurnaan e-commerce, ERP, dan aplikasi mobile untuk berbagai kebutuhan bisnis."
                }
            ]
        },
        {
            "name": "PT Foxbyte Global Inovasi",
            "position": "Frontend Developer",
            "duration": "September 2024 - Current",
            "items": [{
                    "name": null,
                    "description": "Slicing UI dengan Nuxtjs Berbasis VueJs 3"
                },
                {
                    "name": null,
                    "description": "Optimisasi Page, Implement Pinia dan juga Integrasi dengan API"
                },
                {
                    "name": null,
                    "description": "Penggunaan tailwind css sebagai library css"
                }
            ]
        },
        {
            "name": "PT Foxbyte Global Inovasi",
            "position": "Co-Lead  Project Manager",
            "duration": "February 2022 - October 2022",
            "items": [{
                    "name": null,
                    "description": "Melakukan pencatatan task dan distribusi task ke team"
                },
                {
                    "name": null,
                    "description": "Mengatur timeline pengembangan sistem & aplikasi"
                },
                {
                    "name": null,
                    "description": "Melakukan rekapan pelaporan sistem pengujian dari QA"
                },
                {
                    "name": null,
                    "description": "Melakukan diskusi dan meeting bersama client untuk kepentingan pengembangan sistem & aplikasi"
                }
                
            ]
        },
        {
            "name": "PT Foxbyte Global Inovasi",
            "position": "Software Quality Assurance",
            "duration": "March 2020 - September 2024",
            "items": [{
                    "name": null,
                    "description": "Melakukan pembuatan testcase berbasis excel untuk aplikasi dan product"
                },
                {
                    "name": null,
                    "description": "Melakukan pengujian berbasis testcase yang telah dibuat"
                },
                {
                    "name": null,
                    "description": "Memberikan pelaporan pengujian setiap hari jumat ke PM"
                },
                {
                    "name": null,
                    "description": "Metode testing yang digunakan masih berbasis manual dan juga automatic ( Selenium )"
                }
                
            ]
        },
        {
            "name": "Colony Labs",
            "position": "Quality Assurance",
            "duration": "September 2019 - Januari 2024",
            "items": [{
                    "name": null,
                    "description": "Melakukan pembuatan testcase berbasis excel untuk aplikasi Lestari Diskon"
                },
                {
                    "name": null,
                    "description": "Melakukan pengujian berbasis testcase yang telah dibuat"
                },
                {
                    "name": null,
                    "description": "Memberikan pelaporan pengujian setiap hari jumat ke PM"
                },
                {
                    "name": null,
                    "description": "Metode testing yang digunakan masih berbasis manual ( tidak automatic )"
                }
                
            ]
        }
    ]

    }
}